import java.nio.file.Path;

class Task {
    /**
     * Написать функцию которая пройдет по всем каталогам внутри root и поднимет все файлы существующие в подкаталогах в root.
     * Все встречающиеся подкаталоги - удалить после того как все файлы из них будут перемещены в root
     * Написать Junit тест на работу этой функции
     * Можно создавать дополнительные функции в рамках данного класса
     * Использовать любые средства из JDK 8
     *
     * @param root - starting directory
     */
    static void filesUp(Path root) {
        // code here
    }

    // code here
}